Catalogs/АС_Объекты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>АС_Объекты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>cfg:EnumRef.АС_ВидОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Индентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подсистема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АС_Подсистемы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменен</Name>
					<Type>
						<v8:Type>cfg:EnumRef.АС_Изменения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>АС_Реквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РеквизитИмя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>256</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РеквизитСиноним</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>256</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РеквизитТип</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>128</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АС_Связь</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АлгоритмЗаполнение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>512</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АС_ТабличнаяЧасть</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АС_ТабличныеЧасти</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроверкаЗаполнения</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Формы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>АС_Форма</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АС_Формы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РеквизитИмя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>256</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПроцедурыФункции</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Модуль</Name>
							<Type>
								<v8:Type>cfg:EnumRef.АС_Модули</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АС_ПроцедурыФункции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Регистры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>АС_Объект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АС_Объекты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Изменения</Name>
				</Properties>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Расширения</Name>
				</Properties>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/АС_ОбщийМодульСервер/Ext/Module.bsl
Функция СоздатьОбъектАС(Структура)  Экспорт 
	 
	НовАС_Объект = Справочники.АС_Объекты.СоздатьЭлемент();	
	НовАС_Объект.Индентификатор = Структура.Индентификатор;
	НовАС_Объект.Наименование  	= Структура.Наименование; 
	НовАС_Объект.Вид            = Структура.Вид;
	НовАС_Объект.Подсистема     = Структура.Подсистема;
	НовАС_Объект.Изменен        = Структура.Изменен;

	НовАС_Объект.Записать();
	
	ЗаполнитьРеквизитыОбъектаАС(НовАС_Объект.Ссылка);

	Возврат НовАС_Объект.Ссылка;
	
КонецФункции 

Процедура ЗаполнитьРеквизитыОбъектаАС(Ссылка) Экспорт
		
	СпрОбъект = Ссылка.ПолучитьОбъект(); 	
	СпрОбъект.АС_Реквизиты.Очистить(); 
		
	Структура = Новый Структура; 
	Структура.Вставить("тВид"	, Строка(СпрОбъект.Вид));
	Структура.Вставить("ИД"		, СпрОбъект.Индентификатор);
	Структура.Вставить("Табл"	, СпрОбъект.АС_Реквизиты);
	Структура.Вставить("ТЧ"		, Неопределено);
	
	ЗаполнитьРеквизитыАС(Структура); 
	
	Для Каждого Метаданное Из Метаданные[Структура.тВид][Структура.ИД].ТабличныеЧасти Цикл 
		ИмяТЧ = Метаданное.Имя;
		ТабЧасть =  Справочники.АС_ТабличныеЧасти.НайтиПоНаименованию(ИмяТЧ);
		
		Если Не ЗначениеЗаполнено(ТабЧасть) Тогда 
			ТабЧасть = СоздатьАС_ТабличныеЧасти(ИмяТЧ);
		КонецЕсли;
		
		Структура.Вставить("ТЧ"		, ТабЧасть);
		
		ЗаполнитьРеквизитыАС(Структура);
	КонецЦикла;	
	
	СпрОбъект.Записать();
		
КонецПроцедуры

Процедура ЗаполнитьРеквизитыАС(Структура) 

	Для Каждого Метаданное Из Метаданные[Структура.тВид][Структура.ИД].Реквизиты Цикл 
		НовСтрока = Структура.Табл.Добавить(); 
		НовСтрока.РеквизитСиноним 	= Метаданное.Синоним;
		НовСтрока.РеквизитИмя 		= Метаданное.Имя;
		
		Если Не Структура.ТЧ = Неопределено Тогда 
			НовСтрока.АС_ТабличнаяЧасть = Структура.ТЧ;
		КонецЕсли;	
		
		ТипыР = Метаданное.Тип.Типы();
		ТипР = "";
		Для Каждого стрТип Из ТипыР Цикл
			ПоискТип = Метаданные.НайтиПоТипу(стрТип);
			Если ПоискТип = Неопределено Тогда 
				РеквизитТип 		= Метаданное.Тип;	
			Иначе 	
				ТипР = ТипР + ?(ТипР = "","","; ") + Метаданные.НайтиПоТипу(стрТип).ПолноеИмя();
				РеквизитТип = ТипР;		
			КонецЕсли;
		КонецЦикла;
		
		НовСтрока.РеквизитТип 			= РеквизитТип; 		 
		НовСтрока.ПроверкаЗаполнения 	= Метаданное.ПроверкаЗаполнения = ПроверкаЗаполнения.ВыдаватьОшибку; 			
	
	КонецЦикла;

КонецПроцедуры

Функция СоздатьАС_ТабличныеЧасти(ИмяТЧ)
	 СправочникСсылка = Справочники.АС_ТабличныеЧасти.ПустаяСсылка();
	 
	 СправочникОбъект = Справочники.АС_ТабличныеЧасти.СоздатьЭлемент();
	 СправочникОбъект.Наименование = ИмяТЧ;
	 СправочникОбъект.Записать();
	 СправочникСсылка = СправочникОбъект.Ссылка;
	 
	 Возврат СправочникСсылка;
КонецФункции
